{
  "recetas": [
    {
      "nombreReceta": "Camarones con fideos",
      "imagen": "https://images.pexels.com/photos/1150447/pexels-photo-1150447.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "descripcion": "Ingredientes:\n\n250 gramos de camarones pelados y desvenados\n200 gramos de fideos de tu elección (pueden ser de trigo, arroz o incluso fideos de huevo)\n2 cucharadas de aceite de oliva\n2 dientes de ajo picados\n1 cebolla mediana picada\n1 pimiento rojo picado\n1 zanahoria mediana cortada en juliana\n1 calabacín pequeño cortado en rodajas\n200 gramos de champiñones laminados\n2 cucharadas de salsa de soja\nSal y pimienta al gusto\nOpcional: cilantro fresco picado y rodajas de limón para decorar\nInstrucciones:\n\nCocina los fideos según las instrucciones del paquete. Escúrrelos y reserva.\n\nEn una sartén grande, calienta el aceite de oliva a fuego medio. Agrega el ajo picado y saltea durante unos segundos hasta que esté fragante. Añade la cebolla y el pimiento rojo, y cocínalos hasta que estén tiernos.\n\nAgrega la zanahoria, el calabacín y los champiñones a la sartén. Cocina durante unos minutos hasta que las verduras estén ligeramente tiernas pero aún crujientes.\n\nAñade los camarones a la sartén y saltea hasta que estén rosados y bien cocidos, aproximadamente de 3 a 4 minutos. Asegúrate de no cocinarlos demasiado, ya que podrían volverse gomosos.\n\nAgrega los fideos cocidos a la sartén junto con la salsa de soja. Mezcla bien todos los ingredientes y cocina por unos minutos más para que los sabores se integren.\n\nPrueba y ajusta la sazón con sal y pimienta según tu preferencia.\n\nRetira del fuego y sirve los camarones con fideos en platos individuales. Si deseas, decora con cilantro fresco picado y rodajas de limón.\n\n",
      "id": 1
    },
    {
      "nombreReceta": "Pizza Cocida",
      "imagen": "https://images.pexels.com/photos/1146760/pexels-photo-1146760.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "descripcion": "Ingredientes para la masa:\n\n2 ¼ tazas de harina de trigo\n1 cucharadita de levadura seca activa\n1 cucharadita de azúcar\n1 cucharadita de sal\n1 taza de agua tibia\n2 cucharadas de aceite de oliva\nIngredientes para la cobertura (puedes ajustar según tus preferencias):\n\nSalsa de tomate\nQueso mozzarella rallado\nIngredientes adicionales: pepperoni, champiñones, pimientos, cebolla, jamón, aceitunas, etc.\nInstrucciones:\n\nPreparación de la masa:\n\nEn un tazón, mezcla la levadura seca activa, el azúcar y el agua tibia. Deja reposar durante 5 minutos hasta que se forme espuma en la superficie.\nAgrega la harina y la sal al tazón con la levadura activada. Mezcla bien hasta formar una masa suave y elástica.\nAmasa la masa sobre una superficie enharinada durante unos minutos hasta que esté suave y no se pegue a tus manos.\nVierte el aceite de oliva en un tazón limpio y coloca la masa en el tazón, cubriéndola con el aceite. Cubre el tazón con un paño húmedo y deja que la masa repose y fermente durante al menos una hora, o hasta que duplique su tamaño.\nPreparación de la pizza:\n\nPrecalienta el horno a 230 °C (450 °F).\nDivide la masa en porciones según el tamaño de pizza que desees hacer.\nEstira cada porción de masa con un rodillo hasta obtener la forma y el grosor deseados.\nColoca la masa estirada en una bandeja para horno o una piedra para pizza enharinada.\nExtiende una capa generosa de salsa de tomate sobre la masa, dejando un borde sin cubrir.\nEspolvorea queso mozzarella rallado sobre la salsa de tomate.\nAgrega tus ingredientes adicionales favoritos, como pepperoni, champiñones, pimientos, cebolla, jamón, aceitunas, etc.\nLleva la pizza al horno precalentado y hornea durante unos 12-15 minutos, o hasta que la corteza esté dorada y el queso esté derretido y burbujeante.\nUna vez cocida, retira la pizza del horno y deja que se enfríe durante unos minutos antes de cortarla en porciones. ¡Disfruta de tu deliciosa pizza casera!",
      "id": 2
    }
  ],
  "usuarios": [
    {
      "id": 1,
      "nombreUsuario": "admin",
      "email": "admin@rollingcode.com",
      "password": "123456aA"
    },
    {
      "nombreUsuario": "rolo",
      "email": "rodrigovizcarra1996@gmail.com",
      "password": "123456aA",
      "id": 2
    }
  ]
}